Revit 2026 API

# Options Constructor

---

Creates a default Options object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Options()
```
```vb
Public Sub New
```
```cpp
public:
Options()
```
```fsharp
new : unit -> Options
```

Defaults to medium detail, no references and no view.

#### Reference

Options Class

Options Overload

Autodesk.Revit.DB Namespace